"""print('Hello World!!')"""

"""print(1+2)
print(4*5)
print(10/2)
덧셈은 + 뺄셈 - 곱셈 * 나눗셈 /
소숫점 버리기 나눗셈 // 나눗셈한 나머지를 반환 % n의 a승 n ** a"""

"""x = 100
print(x)
변수 활용. 변수에는 문자열을 넣는 것도 가능하다
사용가능한것은 반각영수자, 언더바, 일본어(비추천)
1문자째는 숫자와 불가능
대문자 소문자 구별불가능. 정의되어있는 함수는 불가능.
ex. x = 'python'
print(x)

x=100
y=x+50
print(y)
y=y+1
print(y)"""

"""x=100
y='python'
print(x + y)
숫자는 int형 문자는 str형 데이터. 다른 데이터형을 계산할 수는 없다.

x='100'
y='50'
print(x+y)
print(type(x+y))

int형 정수 float형 부동소숫점 str형 문자열
bool형 true인가 false인가밖에 못 함 
list형 tuple형 dict형 하나의 변수에 여러가지 치를 갖는 것들"""

#리스트형
"""x = ['사과', '바나나', '복숭아']
print(x)
print(x[0])
print(x[1])
print(x[2])
하나의 변수에 복수의 값을 격납하는 것이 가능함.
하나하나의 치를 요소라고 부른다.
요소에는 다양한 데이터형을 넣는 것이 가능하다.
요소에는 선두부터 순서대로 인덱스 번호가 붙으며,
인덱스 번호는 0부터 시작한다.
변수명의 뒤에 []로 인덱스번호를 붙여 지정하는 것으로
각 요소를 사용하거나, 대입하는것이 가능하다."""

#슬라이스
"""x=[0,1,2,3,4,5,6,7,8,9]
print(x)
print(x[2:8])
리스트형이나 문자형으로부터 일부를 빼고 반환하는 기능.
시작위치와 종료위치의 인덱스번호를 콜론에 끼워서 지정.
*종료위치는 결과에 포함되지 않음으로 주의
또한 3번째에 스테프를(간격) 지정하는것도 가능
print(x[:8])
print(x[2:])
print(x[2:8:2])"""

